---
kind: method
id: M:Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute(System.String,System.Collections.Generic.ISet{Autodesk.Revit.DB.IFC.IFCAnyHandle})
source: html/afef86a9-8745-fcc6-e844-f32ab917ce4b.htm
---
# Autodesk.Revit.DB.IFC.IFCAnyHandle.SetAttribute Method

## Syntax (C#)
```csharp
public void SetAttribute(
	string name,
	ISet<IFCAnyHandle> values
)
```

## Parameters
- **name** (`System.String`)
- **values** (`System.Collections.Generic.ISet < IFCAnyHandle >`)